In [1]:
import pandas as pd

In [2]:
#Q.1
list = ['sort_value','sort_index','concat','DataFrame','date_range']

In [3]:
pd.Series(list)

0    sort_value
1    sort_index
2        concat
3     DataFrame
4    date_range
dtype: object

In [4]:
#Q.2
df = pd.DataFrame({'a':[0],
                  'b':[1],
                  'c':[2]})

In [5]:
df

   a  b  c
0  0  1  2

In [6]:
df.set_index('a')

   b  c
a
0  1  2

In [7]:
df.reindex()

   a  b  c
0  0  1  2

In [8]:
#Q.3
df = pd.DataFrame({'values':[2,3,4]})

In [9]:
df

   values
0       2
1       3
2       4

In [12]:
df['word_count'] = df['text'].apply(lambda x : len(x.split()))

In [13]:
df

                                   text  word_count
0  this is my pandas advance assignment           6

In [14]:
#Q.5
df1 = pd.read_csv('titanic.csv')

In [15]:
size = df1.size
print("Size = {}".format(size))

Size = 10692

In [16]:
shape = df1.shape
print("Shape = {}".format(shape))

Shape = (891, 12)

In [17]:
#Q.6
# 'read_excel' function of pandas do we use to read an excel file

In [18]:
#Q.7
df = pd.DataFrame({'Email':['lokesh@gmail.com','ramesh@gmail.com','mukesh@gmail.com','kavish@gmail.com']})

In [19]:
df['username'] = df['Email'].apply(lambda x : x[0:6])

In [20]:
df

              Email username
0  lokesh@gmail.com   lokesh
1  ramesh@gmail.com   ramesh
2  mukesh@gmail.com   mukesh
3  kavish@gmail.com   kavish

In [21]:
#Q.8
df = pd.DataFrame({'A':[3,8,6,2,9],
                   'B':[5,2,9,3,1],
                   'C':[1,7,4,5,2]})

In [22]:
df[['A','B','C']][1::3]

   A  B  C
1  8  2  7
4  9  1  2

In [23]:
#Q.9
df = pd.DataFrame({'values':[5,6,7,8]})

In [24]:
df[['values']].mean()

values    6.5
dtype: float64

In [25]:
df[['values']].median()

values    6.5
dtype: float64

In [26]:
df[['values']].std()

values    1.290994
dtype: float64

In [27]:
#Q.10
df = pd.DataFrame({'sales':[10,30,60,80,90,70,65],
                   'date':['25-07-2023','26-07-2023','27-07-2023','28-07-2023','29-07-2023','30-07-2023','1-08-2023']})

In [28]:
df['MovingAverage'] = df['sales'].mean()

In [29]:
df

   sales        date  MovingAverage
0     10  25-07-2023      57.857143
1     30  26-07-2023      57.857143
2     60  27-07-2023      57.857143
3     80  28-07-2023      57.857143
4     90  29-07-2023      57.857143
5     70  30-07-2023      57.857143
6     65   1-08-2023      57.857143

In [30]:
#Q.11
date = pd.date_range(start='2023-01-01', end='2023-01-05')

In [31]:
df = pd.DataFrame({'date':date})

In [32]:
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [33]:
df['weekday'] = df['date'].dt.day_name()

In [34]:
df

        date    weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [35]:
date = pd.date_range(start = '2023-01-01', end = '2023-01-31')

In [36]:
 pd.DataFrame({'date':date})

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [37]:
#Q13.
#To use the basic functions of pandas, 'read_csv' is the first and foremost necessary library that needs to be imported?